## Pandas intoduction

Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

### Series

In [1]:
import pandas as pd
s = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd']) # create series object from value and string index lists
s

a    1
b    2
c    3
d    4
dtype: int64

In [2]:
r = pd.Series([5, 6, 7, 8]) # # create series object without strong adjusted indices
r

0    5
1    6
2    7
3    8
dtype: int64

In [3]:
d = {'Moscow': 1000, 'London': 300, 'New York': 150, 'Barcelona': None} # create dictionary
cities = pd.Series(d) # create series object from dictionary
cities

Barcelona       NaN
London        300.0
Moscow       1000.0
New York      150.0
dtype: float64

In [4]:
cities['Moscow']

1000.0

In [5]:
cities[['Moscow', 'London']]

Moscow    1000.0
London     300.0
dtype: float64

In [6]:
cities < 1000 # create conditional mask

Barcelona    False
London        True
Moscow       False
New York      True
dtype: bool

In [7]:
cities[cities < 1000] # conditional slicing

London      300.0
New York    150.0
dtype: float64

In [8]:
cities['Moscow'] = 100 # change value of series element 
cities

Barcelona      NaN
London       300.0
Moscow       100.0
New York     150.0
dtype: float64

In [9]:
cities[cities < 1000] = 3 # change values of series slice
cities

Barcelona    NaN
London       3.0
Moscow       3.0
New York     3.0
dtype: float64

In [10]:
cities * 3

Barcelona    NaN
London       9.0
Moscow       9.0
New York     9.0
dtype: float64

In [11]:
cities.isnull() # create conditional mask

Barcelona     True
London       False
Moscow       False
New York     False
dtype: bool

In [12]:
cities[cities.isnull()]  # conditional slicing (values egual NaN)

Barcelona   NaN
dtype: float64

In [13]:
cities.notnull() # create conditional mask

Barcelona    False
London        True
Moscow        True
New York      True
dtype: bool

In [14]:
cities[cities.notnull()]  # conditional slicing (values do to egual NaN)

London      3.0
Moscow      3.0
New York    3.0
dtype: float64

### DataFrame

In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv('citibike.csv')

In [17]:
df.head(3)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,704,7/1/2016 00:00:02,7/1/2016 00:11:47,459,W 20 St & 11 Ave,40.746745,-74.007756,347,Greenwich St & W Houston St,40.728846,-74.008591,17431,Customer,NaN,0
1,492,7/1/2016 00:00:18,7/1/2016 00:08:31,293,Lafayette St & E 8 St,40.730287,-73.990765,466,W 25 St & 6 Ave,40.743954,-73.991449,24159,Subscriber,1984.0,1
2,191,7/1/2016 00:00:19,7/1/2016 00:03:31,3090,N 8 St & Driggs Ave,40.717746,-73.956001,3107,Bedford Ave & Nassau Ave,40.723117,-73.952123,16345,Subscriber,1986.0,2

In [18]:
df.tail(2)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
28,209,7/1/2016 00:02:31,7/1/2016 00:06:01,410,Suffolk St & Stanton St,40.720664,-73.985180,473,Rivington St & Chrystie St,40.721101,-73.991925,25845,Subscriber,1984.0,1
29,492,7/1/2016 00:02:32,7/1/2016 00:10:44,481,S 3 St & Bedford Ave,40.712605,-73.962644,3109,Banker St & Meserole Ave,40.726060,-73.956210,23648,Subscriber,1991.0,2

In [19]:
df.shape # dimension of dataframe

(30, 15)

In [20]:
df.columns # names of dataframe columns

Index([u'tripduration', u'starttime', u'stoptime', u'start station id',
       u'start station name', u'start station latitude',
       u'start station longitude', u'end station id', u'end station name',
       u'end station latitude', u'end station longitude', u'bikeid',
       u'usertype', u'birth year', u'gender'],
      dtype='object')

In [21]:
df.dtypes # types of dataframe columns

tripduration                 int64
starttime                   object
stoptime                    object
start station id             int64
start station name          object
start station latitude     float64
start station longitude    float64
end station id               int64
end station name            object
end station latitude       float64
end station longitude      float64
bikeid                       int64
usertype                    object
birth year                 float64
gender                       int64
dtype: object

In [22]:
df[['starttime', 'start station name']].head() # dataframe slicing

           starttime     start station name
0  7/1/2016 00:00:02       W 20 St & 11 Ave
1  7/1/2016 00:00:18  Lafayette St & E 8 St
2  7/1/2016 00:00:19    N 8 St & Driggs Ave
3  7/1/2016 00:00:24       W 20 St & 11 Ave
4  7/1/2016 00:00:31  Greenwich Ave & 8 Ave

In [23]:
df.iloc[0] # first row froom dataframe

tripduration                                       704
starttime                            7/1/2016 00:00:02
stoptime                             7/1/2016 00:11:47
start station id                                   459
start station name                    W 20 St & 11 Ave
start station latitude                         40.7467
start station longitude                       -74.0078
end station id                                     347
end station name           Greenwich St & W Houston St
end station latitude                           40.7288
end station longitude                         -74.0086
bikeid                                           17431
usertype                                      Customer
birth year                                         NaN
gender                                               0
Name: 0, dtype: object

In [24]:
df.iloc[-1] # last row froom dataframe

tripduration                                    492
starttime                         7/1/2016 00:02:32
stoptime                          7/1/2016 00:10:44
start station id                                481
start station name             S 3 St & Bedford Ave
start station latitude                      40.7126
start station longitude                    -73.9626
end station id                                 3109
end station name           Banker St & Meserole Ave
end station latitude                        40.7261
end station longitude                      -73.9562
bikeid                                        23648
usertype                                 Subscriber
birth year                                     1991
gender                                            2
Name: 29, dtype: object

In [25]:
df.iloc[-1, 4] # certain value from last row and fifth column

'S 3 St & Bedford Ave'

In [26]:
df.loc[1, ['tripduration']] # certain value from first row and first column (by column label)

tripduration    492
Name: 1, dtype: object

In [27]:
df.iloc[0:6, 0:4] # slicing by iloc method

   tripduration          starttime           stoptime  start station id
0           704  7/1/2016 00:00:02  7/1/2016 00:11:47               459
1           492  7/1/2016 00:00:18  7/1/2016 00:08:31               293
2           191  7/1/2016 00:00:19  7/1/2016 00:03:31              3090
3           687  7/1/2016 00:00:24  7/1/2016 00:11:52               459
4           609  7/1/2016 00:00:31  7/1/2016 00:10:40               284
5           672  7/1/2016 00:00:45  7/1/2016 00:11:57               459

In [28]:
df.loc[0:6, 'tripduration': 'start station name'] # slicing by loc method

,tripduration,starttime,stoptime,start station id,start station name
0,704,7/1/2016 00:00:02,7/1/2016 00:11:47,459,W 20 St & 11 Ave
1,492,7/1/2016 00:00:18,7/1/2016 00:08:31,293,Lafayette St & E 8 St
2,191,7/1/2016 00:00:19,7/1/2016 00:03:31,3090,N 8 St & Driggs Ave
3,687,7/1/2016 00:00:24,7/1/2016 00:11:52,459,W 20 St & 11 Ave
4,609,7/1/2016 00:00:31,7/1/2016 00:10:40,284,Greenwich Ave & 8 Ave
5,672,7/1/2016 00:00:45,7/1/2016 00:11:57,459,W 20 St & 11 Ave
6,466,7/1/2016 00:00:49,7/1/2016 00:08:35,128,MacDougal St & Prince St

In [29]:
df['tripduration'] < 400

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23     True
24     True
25    False
26    False
27    False
28     True
29    False
Name: tripduration, dtype: bool

In [30]:
df[df['tripduration'] < 400] # filtration (one condition)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
2,191,7/1/2016 00:00:19,7/1/2016 00:03:31,3090,N 8 St & Driggs Ave,40.717746,-73.956001,3107,Bedford Ave & Nassau Ave,40.723117,-73.952123,16345,Subscriber,1986.0,2
12,306,7/1/2016 00:01:07,7/1/2016 00:06:13,264,Maiden Ln & Pearl St,40.707065,-74.007319,376,John St & William St,40.708621,-74.007222,22569,Subscriber,1981.0,1
21,362,7/1/2016 00:02:01,7/1/2016 00:08:04,157,Henry St & Atlantic Ave,40.690893,-73.996123,324,DeKalb Ave & Hudson Ave,40.689888,-73.981013,16326,Subscriber,1966.0,1
23,351,7/1/2016 00:02:05,7/1/2016 00:07:57,490,8 Ave & W 33 St,40.751551,-73.993934,485,W 37 St & 5 Ave,40.750380,-73.983390,25788,Subscriber,1987.0,1
24,328,7/1/2016 00:02:11,7/1/2016 00:07:40,492,W 33 St & 7 Ave,40.750200,-73.990931,540,Lexington Ave & E 29 St,40.743116,-73.982154,22022,Subscriber,1972.0,1
28,209,7/1/2016 00:02:31,7/1/2016 00:06:01,410,Suffolk St & Stanton St,40.720664,-73.985180,473,Rivington St & Chrystie St,40.721101,-73.991925,25845,Subscriber,1984.0,1

In [31]:
df[(df['tripduration'] < 400) & (df['usertype'] == 'Subscriber')] # filtration (two conditions)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
2,191,7/1/2016 00:00:19,7/1/2016 00:03:31,3090,N 8 St & Driggs Ave,40.717746,-73.956001,3107,Bedford Ave & Nassau Ave,40.723117,-73.952123,16345,Subscriber,1986.0,2
12,306,7/1/2016 00:01:07,7/1/2016 00:06:13,264,Maiden Ln & Pearl St,40.707065,-74.007319,376,John St & William St,40.708621,-74.007222,22569,Subscriber,1981.0,1
21,362,7/1/2016 00:02:01,7/1/2016 00:08:04,157,Henry St & Atlantic Ave,40.690893,-73.996123,324,DeKalb Ave & Hudson Ave,40.689888,-73.981013,16326,Subscriber,1966.0,1
23,351,7/1/2016 00:02:05,7/1/2016 00:07:57,490,8 Ave & W 33 St,40.751551,-73.993934,485,W 37 St & 5 Ave,40.750380,-73.983390,25788,Subscriber,1987.0,1
24,328,7/1/2016 00:02:11,7/1/2016 00:07:40,492,W 33 St & 7 Ave,40.750200,-73.990931,540,Lexington Ave & E 29 St,40.743116,-73.982154,22022,Subscriber,1972.0,1
28,209,7/1/2016 00:02:31,7/1/2016 00:06:01,410,Suffolk St & Stanton St,40.720664,-73.985180,473,Rivington St & Chrystie St,40.721101,-73.991925,25845,Subscriber,1984.0,1

In [32]:
df.describe() # view dataframe statistic info

,tripduration,start station id,start station latitude,start station longitude,end station id,end station latitude,end station longitude,bikeid,birth year,gender
count,30.000000,30.000000,30.000000,30.000000,30.000000,30.000000,30.000000,30.000000,25.000000,30.000000
mean,797.466667,529.433333,40.731871,-73.992881,573.700000,40.733723,-73.989227,20263.033333,1984.120000,1.066667
std,558.310860,714.275021,0.018098,0.017158,697.392639,0.015794,0.014889,4047.818548,7.149126,0.639684
min,191.000000,127.000000,40.690893,-74.009447,174.000000,40.689888,-74.008591,14676.000000,1966.000000,0.000000
25%,464.500000,269.000000,40.723604,-74.006474,329.500000,40.724936,-74.001034,16399.750000,1981.000000,1.000000
50%,582.500000,359.500000,40.730380,-73.998004,437.000000,40.734048,-73.990506,19944.000000,1986.000000,1.000000
75%,1053.000000,459.000000,40.744569,-73.987734,499.250000,40.743291,-73.981754,24031.250000,1989.000000,1.000000
max,2229.000000,3150.000000,40.775369,-73.948034,3109.000000,40.765849,-73.952123,25925.000000,1994.000000,2.000000

In [33]:
df.describe(include=[np.object]) # view dataframe statistic info (only categorical features)

,starttime,stoptime,start station name,end station name,usertype
count,30,30,30,30,30
unique,27,30,23,26,2
top,7/1/2016 00:00:51,7/1/2016 00:38:34,W 20 St & 11 Ave,Greenwich St & W Houston St,Subscriber
freq,2,1,3,3,25

In [34]:
df['usertype'].value_counts(normalize=True)

Subscriber    0.833333
Customer      0.166667
Name: usertype, dtype: float64

In [35]:
df['gender'].unique()

array([0, 1, 2])

In [36]:
df.corr() # features (value columns) correlation

,tripduration,start station id,start station latitude,start station longitude,end station id,end station latitude,end station longitude,bikeid,birth year,gender
tripduration,1.000000,0.005958,0.279717,-0.155065,-0.208088,0.443372,-0.015035,-0.083743,0.220732,-0.228435
start station id,0.005958,1.000000,0.289613,0.678618,0.492051,-0.049569,0.416501,-0.000742,0.201254,0.174797
start station latitude,0.279717,0.289613,1.000000,-0.020152,-0.220959,0.529299,-0.228736,0.056788,0.369665,-0.214625
start station longitude,-0.155065,0.678618,-0.020152,1.000000,0.559629,-0.161206,0.728681,0.312968,0.119667,0.332913
end station id,-0.208088,0.492051,-0.220959,0.559629,1.000000,-0.110345,0.693786,0.032875,0.154493,0.424481
end station latitude,0.443372,-0.049569,0.529299,-0.161206,-0.110345,1.000000,-0.080409,0.118937,0.183303,-0.288049
end station longitude,-0.015035,0.416501,-0.228736,0.728681,0.693786,-0.080409,1.000000,0.175795,-0.026347,0.518770
bikeid,-0.083743,-0.000742,0.056788,0.312968,0.032875,0.118937,0.175795,1.000000,-0.037950,-0.190518
birth year,0.220732,0.201254,0.369665,0.119667,0.154493,0.183303,-0.026347,-0.037950,1.000000,0.383581
gender,-0.228435,0.174797,-0.214625,0.332913,0.424481,-0.288049,0.518770,-0.190518,0.383581,1.000000

In [37]:
df.sample(frac=0.1) # sample of dataframe

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
13,1353,7/1/2016 00:01:08,7/1/2016 00:23:41,3150,E 85 St & York Ave,40.775369,-73.948034,461,E 20 St & 2 Ave,40.735877,-73.982050,22314,Subscriber,1990.0,1
4,609,7/1/2016 00:00:31,7/1/2016 00:10:40,284,Greenwich Ave & 8 Ave,40.739017,-74.002638,212,W 16 St & The High Line,40.743349,-74.006818,15514,Customer,NaN,0
6,466,7/1/2016 00:00:49,7/1/2016 00:08:35,128,MacDougal St & Prince St,40.727103,-74.002971,250,Lafayette St & Jersey St N,40.724561,-73.995653,14676,Subscriber,1989.0,1

In [38]:
df.to_csv('path_to_file.csv') # dataframe saving to new csv file

## Data grouping

In [39]:
df.groupby(['usertype']) # group rows by usertype column

In [40]:
df.groupby(['usertype']).groups # see groups - dictionaries (key = usertype value, values = row indices)

{'Customer': Int64Index([0, 3, 4, 15, 22], dtype='int64'),
 'Subscriber': Int64Index([ 1,  2,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20,
             21, 23, 24, 25, 26, 27, 28, 29],
            dtype='int64')}

In [41]:
df.groupby(['usertype']).first() # first row each groups

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,birth year,gender
usertype,,,,,,,,,,,,,,
Customer,704,7/1/2016 00:00:02,7/1/2016 00:11:47,459,W 20 St & 11 Ave,40.746745,-74.007756,347,Greenwich St & W Houston St,40.728846,-74.008591,17431,NaN,0
Subscriber,492,7/1/2016 00:00:18,7/1/2016 00:08:31,293,Lafayette St & E 8 St,40.730287,-73.990765,466,W 25 St & 6 Ave,40.743954,-73.991449,24159,1984.0,1

In [42]:
df.groupby(['usertype'])[['tripduration']].mean() # mean values for each groups and tripduration column

            tripduration
usertype
Customer          952.40
Subscriber        766.48

In [43]:
df.groupby(['usertype', 'start station name'])[['tripduration']].mean() # mean values for each groups and tripduration and  start station name column

                                        tripduration
usertype   start station name
Customer   Greenwich Ave & 8 Ave               571.0
           W 20 St & 11 Ave                    695.5
           W 22 St & 8 Ave                    2229.0
Subscriber 6 Ave & Canal St                   1145.0
           8 Ave & W 33 St                     351.0
           Barrow St & Hudson St              1226.0
           E 11 St & 2 Ave                     659.0
           E 13 St & Avenue A                  556.0
           E 33 St & 2 Ave                     464.0
           E 85 St & York Ave                 1353.0
           Franklin Ave & Myrtle Ave           777.0
           Fulton St & Broadway                472.0
           Greenwich St & W Houston St        1883.5
           Henry St & Atlantic Ave             362.0
           Lafayette St & E 8 St              1113.5
           MacDougal St & Prince St            442.5
           Maiden Ln & Pearl St                306.0
           N 8 St & Driggs Ave                 191.0
           S 3 St & Bedford Ave                492.0
           Suffolk St & Stanton St             209.0
           W 11 St & 6 Ave                     639.0
           W 20 St & 11 Ave                    672.0
           W 33 St & 7 Ave                     328.0
           W 43 St & 10 Ave                   1442.0

In [44]:
df.groupby(['usertype']).agg({'tripduration': sum, 'starttime': 'first'})

            tripduration          starttime
usertype
Customer            4762  7/1/2016 00:00:02
Subscriber         19162  7/1/2016 00:00:18

In [45]:
df.groupby(['usertype']).agg({'tripduration': [sum, min], 'starttime': 'first'})

           tripduration               starttime
                    sum  min              first
usertype
Customer           4762  533  7/1/2016 00:00:02
Subscriber        19162  191  7/1/2016 00:00:18

In [46]:
df.groupby(['usertype']).agg({'tripduration': lambda x: max(x) + 1, 'starttime': 'first'}) # create own lambda function

            tripduration          starttime
usertype
Customer            2230  7/1/2016 00:00:02
Subscriber          2200  7/1/2016 00:00:18

### Map function

In [56]:
import pandas as pd
import numpy as np

In [57]:
df = pd.read_csv('citibike.csv')

In [58]:
df.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,704,7/1/2016 00:00:02,7/1/2016 00:11:47,459,W 20 St & 11 Ave,40.746745,-74.007756,347,Greenwich St & W Houston St,40.728846,-74.008591,17431,Customer,NaN,0
1,492,7/1/2016 00:00:18,7/1/2016 00:08:31,293,Lafayette St & E 8 St,40.730287,-73.990765,466,W 25 St & 6 Ave,40.743954,-73.991449,24159,Subscriber,1984.0,1
2,191,7/1/2016 00:00:19,7/1/2016 00:03:31,3090,N 8 St & Driggs Ave,40.717746,-73.956001,3107,Bedford Ave & Nassau Ave,40.723117,-73.952123,16345,Subscriber,1986.0,2
3,687,7/1/2016 00:00:24,7/1/2016 00:11:52,459,W 20 St & 11 Ave,40.746745,-74.007756,347,Greenwich St & W Houston St,40.728846,-74.008591,25210,Customer,NaN,0
4,609,7/1/2016 00:00:31,7/1/2016 00:10:40,284,Greenwich Ave & 8 Ave,40.739017,-74.002638,212,W 16 St & The High Line,40.743349,-74.006818,15514,Customer,NaN,0

In [59]:
usertype = {'Customer': 1, 'Subscriber': 2}
df['usertype'].map(usertype).head()

0    1
1    2
2    2
3    1
4    1
Name: usertype, dtype: int64

### Apply

In [60]:
df.apply(min)

tripduration                             191
starttime                  7/1/2016 00:00:02
stoptime                   7/1/2016 00:03:31
start station id                         127
start station name          6 Ave & Canal St
start station latitude               40.6909
start station longitude             -74.0094
end station id                           174
end station name             1 Ave & E 16 St
end station latitude                 40.6899
end station longitude               -74.0086
bikeid                                 14676
usertype                            Customer
birth year                               NaN
gender                                     0
dtype: object

In [61]:
df['tripduration'].apply(lambda x: x/60).head()

0    11
1     8
2     3
3    11
4    10
Name: tripduration, dtype: int64

In [62]:
df.apply(lambda x: x['tripduration']/60, axis=1).head()

0    11
1     8
2     3
3    11
4    10
dtype: int64